// // Задача №18. Работа в группах
// // Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y)

// Console.Write("Введите число от 1 до 4: ");
// int n = Convert.ToInt32(Console.ReadLine());

// switch (n)
// {
//     case 1:
//         Console.Write("X > 0 && Y < 0");
//         break;


//     case 2:
//         Console.Write("X > 0 && Y > 0");
//         break;


//     case 3:
//         Console.Write("X < 0 && Y < 0");
//         break;


//     case 4:
//         Console.Write("X > 0 && Y < 0");
//         break;
//     default:
//     Console.WriteLine("Ошибка");
//     break;
// }

