# Задача №3. Решение в группах.

# В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами. 
# За каждой партой может сидеть два учащихся. 
# Известно количество учащихся в каждом из трех классов. 
# Выведите наименьшее число парт, которое нужно приобрести для них.

# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32

import math
a = int (input('Введите количество учащихся в классе А: '))
b = int (input('Введите количество учащихся в классе Б: '))
c = int (input('Введите количество учащихся в классе В: '))
print('Вам понадобится', (math.ceil(a/2))+(math.ceil(b/2))+(math.ceil(c/2)), 'парт(ы)')